<h4>ΑΜ: Π2019107
<br>Ονοματεπώνυμο: Θεόδωρος Ζερβάκης

| Εβδομάδα |  Ολα τα παραδοτεα | Σύνδεσμος στην [εβδομαδιαία παρουσίαση προόδου στις συζητήσεις](https://github.com/courses-ionio/help/discussions/categories/show-and-tell) | Αυτοαξιολόγηση σύμφωνα με τα κριτήρια της αντίστοιχης άσκησης |
| --- | --- | --- | --- |
| 1 | Δημιουργία ομάδας + Φορκ και δημιουργία σελίδας τελικής αναφοράς, προσθήκη πίνακα περιεχομένων, συγγραφή της εισαγωγής, αποστολή της εισαγωγής για σχολιασμό στην συζήτηση και καταγραφή του συνδέσμου συζήτησης δίπλα --> |
| 2 | Γραμμή εντολών (systemd) και διαδικασία συνεργασίας με pull request στον οργανισμό της ομάδας σας | | |
| 3 | Γραμμή εντολών (no systemd) | | |
| 4 | Κατασκευή του βιβλίου Α2 (συνεργατικά)| | |
| 5 | Συμμετοχικό περιεχόμενο A1 + A2 | | |
| 6 | Γραμμή εντολών (no systemd, custom static blog generator) | | |
| 7 | συμμετοχικό περιεχόμενο B1 | | |
| 8 | Κατασκευή του βιβλίου Β2 (συνεργατικά) | | |
| 9 | συμμετοχικό περιεχόμενο B2 | | |
| 10 | Τελική αναφορά* | | |
  
  
  
  <br><br>
<h2><span id="Εισαγωγή στο μάθημα">(1) Εισαγωγή στο μάθημα</span></h2>
Με την επιτυχή ολοκλήρωση του μαθήματος ευελπιστώ να είμαι σε θέση να εξηγώ τις επιμέρους φάσεις του και τις διαφορετικές μεθοδολογίες ανάπτυξης λογισμικού καθώς και να περιγράφω, κατηγοριοποιώ, μοντελοποιώ και αναλύω τις απαιτήσεις ενός έργου λογισμικού.Επίσης να μπορώ να σχεδιάσω και να αναπτύξω σύνθετο λογισμικό με βάση τις βέλτιστες διεθνείς πρακτικές.Τέλος περιμένω να βρίσκομαι σε θέση να χρησιμοποιώ με μεγαλύτερη άνεση το github καθώς και το linux.
 <br><br>
Ως στόχους για το μάθημα έχω να παρακολουθώ όσο πιο τακτικά μπορώ τις διαλέξεις, να παρευρίσκομαι στα εργαστήρια καθώς και να ολοκληρώσω όλες τις εβδομαδιαίες εργασίες και τα βίντεο κουιζ προκειμένου να κατανοήσω όσο το δυνατόν καλύτερα το μάθημα. Παράλληλα να συνεργάζομαι με την ομάδα μου και να αλληλοβοηθιόμαστε προκειμένου να ξεπερνάμε τυχόν δυσκολίες που μπορεί να αντιμετωπίσουμε όσον αφορά τα παραδοτέα και τις εργασίες του μαθηματος.
  
